<?php
// +----------------------------------------------------------------------
// | 验证码配置文件
// +----------------------------------------------------------------------

return [
    // 数字验证码
    'number' => [
        //验证码位数
        'length' => 4,
        //验证成功后是否重置
        'reset' => true,
        //验证码字体大小(px)
        'fontSize' => 17,
        //验证码过期时间（s）
        'expire' => 120,
        //验证码图片宽度，设置为0为自动计算
        'imageW' => 120,
        //验证码图片高度，设置为0为自动计算
        'imageH' => 40,
        // 设置验证码字符为纯数字
        'codeSet' => '0123456789',
    ],
];
